
#+PROPERTY: header-args:jupyter-python+ :dir (file-name-directory buffer-file-name) :session mankoff_2020_liquid

*** Minimum runoff depth per ROI

#+BEGIN_SRC jupyter-python :exports both
import xarray as xr
ds = xr.open_dataset('dat/GL_runoff.nc').load()
ds['min_discharge_depth'].to_dataframe()
#+END_SRC

#+RESULTS:
| M2019_region   |   min_discharge_depth |
|----------------+-----------------------|
| CE             |                  -661 |
| CW             |                  -824 |
| NE             |                 -1341 |
| NO             |                 -1094 |
| NW             |                 -1158 |
| SE             |                  -643 |
| SW             |                  -243 |

** Land runoff

+ Split by destination

#+BEGIN_SRC jupyter-python :exports both
import xarray as xr
import numpy as np

ds_land = xr.open_mfdataset('greenland_runoff/freshwater/land/MAR.nc',
                            chunks={'time':365, 'station':100})
ds_ice = xr.open_mfdataset('greenland_runoff/freshwater/ice/MAR.nc',
                            chunks={'time':365, 'station':100})

ds_land = ds_land.reset_coords('alt')
ds_ice = ds_ice.reset_coords('alt')

# Land runoff by destination (use alt metadata = BedMachine depth at outlet location)
land_sub = ds_land.where(ds_land['alt'] < 0).groupby('M2019_region').sum()['discharge'].resample({'time':'MS'}).sum()
land_surf = ds_land.where(ds_land['alt'] >= 0).groupby('M2019_region').sum()['discharge'].resample({'time':'MS'}).sum()

# Max depth of discharge within each region    
sub_depth = ds_land.where(ds_land['alt'] < 0).groupby('M2019_region').min()['alt']

# Ice runoff by destination
ice_sub = ds_ice.where(ds_ice['coast_alt'] < 0).groupby('M2019_region').sum()['discharge'].resample({'time':'MS'}).sum()
ice_surf = ds_ice.where(ds_ice['coast_alt'] >= 0).groupby('M2019_region').sum()['discharge'].resample({'time':'MS'}).sum()

ds = xr.Dataset({'subglacial_discharge_from_land':land_sub,
                 'surface_runoff_from_land':land_surf,
                 'subglacial_discharge_from_ice':ice_sub,
                 'surface_runoff_from_ice':ice_surf,
                 'min_discharge_depth':sub_depth})


# scale from m^3/s -> km^3/sample_period
scale = 86400 / 1E9
# /1E9:  m^3 -> km^3
# 86400: nuber of seconds in a day. Because sum() used above, works for month or year or any resample period
scale_items = ['subglacial_discharge_from_land','surface_runoff_from_land',
               'subglacial_discharge_from_ice','surface_runoff_from_ice']
ds[scale_items] = ds[scale_items] * scale                 

print(ds)
#+END_SRC

#+RESULTS:
#+begin_example
<xarray.Dataset>
Dimensions:                         (M2019_region: 7, time: 876)
Coordinates:
  ,* M2019_region                    (M2019_region) object 'CE' 'CW' ... 'SW'
  ,* time                            (time) datetime64[ns] 1950-01-01 ... 2022...
Data variables:
    subglacial_discharge_from_land  (M2019_region, time) float64 dask.array<chunksize=(1, 1), meta=np.ndarray>
    surface_runoff_from_land        (M2019_region, time) float64 dask.array<chunksize=(1, 1), meta=np.ndarray>
    subglacial_discharge_from_ice   (M2019_region, time) float64 dask.array<chunksize=(1, 1), meta=np.ndarray>
    surface_runoff_from_ice         (M2019_region, time) float64 dask.array<chunksize=(1, 1), meta=np.ndarray>
    min_discharge_depth             (M2019_region) float32 dask.array<chunksize=(1,), meta=np.ndarray>
#+end_example

Write it out using Dask so it works on lightweight machines. This takes a few hours.

#+BEGIN_SRC jupyter-python :exports both
delayed_obj = ds.to_netcdf('dat/GL_runoff.nc', compute=False)
from dask.diagnostics import ProgressBar
with ProgressBar():
    results = delayed_obj.compute()
#+END_SRC
